In [ ]:
# import necessary libraries
import numpy as np
import pandas as pd

In [5]:
# read the dataset
dataset = pd.read_csv('../data/data.csv')
dataset.head()

,COUNTRY,CODE_TIME,TIME,YEAR,MONTH,MONTH_NAME,PRODUCT,VALUE,DISPLAY_ORDER,yearToDate,previousYearToDate,share
0,Australia,JAN2010,January 2010,2010,1,January,Hydro,990.728,1,16471.891,NaN,0.047771
1,Australia,JAN2010,January 2010,2010,1,January,Wind,409.469,2,4940.909,NaN,0.019744
2,Australia,JAN2010,January 2010,2010,1,January,Solar,49.216,3,908.238,NaN,0.002373
3,Australia,JAN2010,January 2010,2010,1,January,Geothermal,0.083,4,0.996,NaN,0.000004
4,Australia,JAN2010,January 2010,2010,1,January,Total combustible fuels,19289.730,7,214302.969,NaN,0.930108

In [ ]:
# Display dataset information
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181915 entries, 0 to 181914
Data columns (total 12 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   COUNTRY             181915 non-null  object
 1   CODE_TIME           181915 non-null  object
 2   TIME                181915 non-null  object
 3   YEAR                181915 non-null  int64
 4   MONTH               181915 non-null  int64
 5   MONTH_NAME          181915 non-null  object
 6   PRODUCT             181915 non-null  object
 7   VALUE               181915 non-null  float64
 8   DISPLAY_ORDER       181915 non-null  int64
 9   yearToDate          181915 non-null  float64
 10  previousYearToDate  164810 non-null  float64
 11  share               181915 non-null  float64
dtypes: float64(4), int64(3), object(5)
memory usage: 16.7+ MB

In [ ]:
# Display the shape of the dataset
dataset.shape

(181915, 12)

In [23]:
# Define a list of European countries
european_countries = [
    'Austria', 'Belgium', 'Bulgaria', 'Croatia', 'Cyprus', 'Czech Republic',
    'Denmark', 'Estonia', 'Finland', 'France', 'Germany', 'Greece', 'Hungary',
    'Iceland', 'Ireland', 'Italy', 'Latvia', 'Lithuania', 'Luxembourg', 'Malta',
    'Netherlands', 'Norway', 'Poland', 'Portugal', 'Romania', 'Slovakia',
    'Slovenia', 'Spain', 'Sweden', 'Switzerland', 'United Kingdom'
]

# Filter the dataset for European countries
df = dataset[dataset['COUNTRY'].isin(european_countries)]

# Save the filtered data to a new CSV 
df.to_csv("../data/european_countries.csv", index=False)
df.head()

,COUNTRY,CODE_TIME,TIME,YEAR,MONTH,MONTH_NAME,PRODUCT,VALUE,DISPLAY_ORDER,yearToDate,previousYearToDate,share
20,Austria,JAN2010,January 2010,2010,1,January,Hydro,2579.264,1,39502.566,NaN,0.437055
21,Austria,JAN2010,January 2010,2010,1,January,Wind,200.966,2,1961.814,NaN,0.034054
22,Austria,JAN2010,January 2010,2010,1,January,Solar,2.864,3,84.421,NaN,0.000485
23,Austria,JAN2010,January 2010,2010,1,January,Geothermal,0.111,4,1.332,NaN,0.000019
24,Austria,JAN2010,January 2010,2010,1,January,Total combustible fuels,3117.160,7,26042.221,NaN,0.528201

In [ ]:
# Create a copy of the filtered DataFrame for further processing
df_europe = df.copy()

In [42]:
# Convert column names to lowercase and rename 'country' to 'country_name'
df_europe.columns = df_europe.columns.str.lower()
df_europe.rename(columns={'country': 'country_name'}, inplace=True)
df_europe.head()

,country_name,code_time,time,year,month,month_name,product,value,display_order,yeartodate,previousyeartodate,share
20,Austria,JAN2010,January 2010,2010,1,January,Hydro,2579.264,1,39502.566,NaN,0.437055
21,Austria,JAN2010,January 2010,2010,1,January,Wind,200.966,2,1961.814,NaN,0.034054
22,Austria,JAN2010,January 2010,2010,1,January,Solar,2.864,3,84.421,NaN,0.000485
23,Austria,JAN2010,January 2010,2010,1,January,Geothermal,0.111,4,1.332,NaN,0.000019
24,Austria,JAN2010,January 2010,2010,1,January,Total combustible fuels,3117.160,7,26042.221,NaN,0.528201

In [43]:
# drop unnecessary columns
columns_to_drop = ['time', 'code_time', 'month_name', 'display_order']
df_europe.drop(columns=columns_to_drop, inplace=True)

In [69]:
df_europe.shape

(107726, 9)

In [65]:
# display the first few rows of the filtered DataFrame
df_europe.head()

,country_name,year,month,product,value,yeartodate,previousyeartodate,share,date
20,Austria,2010,1,Hydro,2579.264,39502.566,0.0,0.437055,2010-01-01
21,Austria,2010,1,Wind,200.966,1961.814,0.0,0.034054,2010-01-01
22,Austria,2010,1,Solar,2.864,84.421,0.0,0.000485,2010-01-01
23,Austria,2010,1,Geothermal,0.111,1.332,0.0,0.000019,2010-01-01
24,Austria,2010,1,Total combustible fuels,3117.160,26042.221,0.0,0.528201,2010-01-01

In [ ]:
# Convert 'YEAR' and 'MONTH' columns to a datetime format
df_europe['date'] = pd.to_datetime(df[['YEAR', 'MONTH']].assign(DAY=1))

In [48]:
df_europe.head()

,country_name,year,month,product,value,yeartodate,previousyeartodate,share,date
20,Austria,2010,1,Hydro,2579.264,39502.566,NaN,0.437055,2010-01-01
21,Austria,2010,1,Wind,200.966,1961.814,NaN,0.034054,2010-01-01
22,Austria,2010,1,Solar,2.864,84.421,NaN,0.000485,2010-01-01
23,Austria,2010,1,Geothermal,0.111,1.332,NaN,0.000019,2010-01-01
24,Austria,2010,1,Total combustible fuels,3117.160,26042.221,NaN,0.528201,2010-01-01

In [49]:
# check for missing values in the DataFrame
df_europe.isnull().sum()

country_name             0
year                     0
month                    0
product                  0
value                    0
yeartodate               0
previousyeartodate    9979
share                    0
date                     0
dtype: int64

In [ ]:
# fill 0 for missing values in 'previousyeartodate' column
df_europe['previousyeartodate'] = df_europe['previousyeartodate'].fillna(0)
df_europe.isnull().sum()

country_name          0
year                  0
month                 0
product               0
value                 0
yeartodate            0
previousyeartodate    0
share                 0
date                  0
dtype: int64

In [ ]:
# Display the data types of the columns in the DataFrame 
df_europe.dtypes

country_name                  object
year                           int64
month                          int64
product                       object
value                        float64
yeartodate                   float64
previousyeartodate           float64
share                        float64
date                  datetime64[ns]
dtype: object

In [59]:
# Check for duplicate rows in the DataFrame
df_europe.duplicated().sum()

np.int64(0)

In [ ]:
# Check unique values in the 'country_name' column
df_europe['country_name'].unique()

array(['Austria', 'Belgium', 'Czech Republic', 'Denmark', 'Estonia',
       'Finland', 'France', 'Germany', 'Greece', 'Hungary', 'Iceland',
       'Ireland', 'Italy', 'Latvia', 'Lithuania', 'Luxembourg',
       'Netherlands', 'Norway', 'Poland', 'Portugal', 'Slovenia', 'Spain',
       'Sweden', 'Switzerland', 'United Kingdom', 'Bulgaria', 'Croatia',
       'Cyprus', 'Malta', 'Romania'], dtype=object)

In [ ]:
# Check unique values in the 'product' column
df_europe['product'].unique()

array(['Hydro', 'Wind', 'Solar', 'Geothermal', 'Total combustible fuels',
       'Coal', 'Oil', 'Natural gas', 'Combustible renewables',
       'Other combustible non-renewables', 'Not specified',
       'Net electricity production', 'Total imports', 'Total exports',
       'Electricity supplied', 'Used for pumped storage',
       'Distribution losses', 'Final consumption', 'Electricity trade',
       'Renewables', 'Non-renewables', 'Others',
       'Other renewables aggregated', 'Low carbon', 'Fossil fuels',
       'Nuclear', 'Other renewables'], dtype=object)

In [62]:
df_europe.describe()

,year,month,value,yeartodate,previousyeartodate,share,date
count,107726.000000,107726.000000,107726.000000,107726.000000,107726.000000,107726.000000,107726
mean,2016.385608,6.498830,2658.317413,31899.453867,16085.236203,0.303847,2016-11-03 21:15:51.012754432
min,2010.000000,1.000000,-4837.906000,-46377.998000,-46377.998000,-4.649269,2010-01-01 00:00:00
25%,2013.000000,3.000000,39.882526,500.730000,69.446042,0.011728,2013-10-01 00:00:00
50%,2017.000000,6.000000,404.065500,4990.839190,1642.035000,0.092185,2017-03-01 00:00:00
75%,2020.000000,9.000000,2041.781534,24654.035999,10134.661500,0.524277,2020-01-01 00:00:00
max,2022.000000,12.000000,61855.823000,619053.007000,619053.007000,5.649269,2022-12-01 00:00:00
std,3.679297,3.452663,6427.464159,76407.756682,46329.744942,0.471774,NaN